# імпортуємо бібліотеку pygame (для створення гри)
import pygame
# імпортуємо наші класи (пташка, труби, кнопка)
from my_class import *


# запускаємо pygame (обов'язково перед використанням)
pygame.init()


'''Імпортуємо модулі для роботи зі звуками та роботиз числами'''
import sounddevice as sd
import numpy as nm

'''Стоври глобальні змінні'''
'''1. частота дискретизації мікрофона (fs = 16000)
👉 Це скільки разів на секунду комп’ютер “знімає” звук'''
fs = 16000
'''2. Розмір блоку аудіо (скільки семплів обробляється за раз)
👉 Це скільки “шматочків звуку” комп’ютер бере за один раз'''
blocks = 256
'''3. Поточний рівень гучності
👉 Це просто - наскільки зараз гучний звукю 0 - тиша, 0.05 - голосно'''
mic_level = 0.0
'''поріг гучності мікрофона, після якого буде стрибок - 0.01. 
        Просто:
            якщо ти тихо говориш → нічого не буде
            якщо голосніше за 0.01 → пташка стрибає'''
TRESH = 0.004    
'''мпульс (швидкість вгору)
👉 Це сила стрибка вгору'''
IMPULSE = 0 


'''Напиши функцію-обробник мікрофона - 
Вона автоматично викликається, коли приходить звук 
Аргументи функції:
 1.indata - 👉 сам звук (масив чисел)
 2. frames - 👉 скільки шматочків звуку прийшло (зазвичай = block)
 3. time - 👉 інформація про час (майже не використовується)
 4. status - 👉 чи є помилка, якщо ок → пусто, якщо щось не так → там буде значення'''
def audio(indata, frames, time, status):
    '''беремо глобальну змінну - Поточний рівень гучності (щоб змінювати її)'''
    global mic_level
    '''якщо є помилка → просто пропускаємо звук'''
    if status:
        return
    '''рахуємо гучність звуку. Просто:
        підносимо до квадрату сам звук(indata)
        беремо середнє - nm.mean
        корінь - nm.sqrt
        👉 отримуємо ДРОБОВЕ число = гучність '''
    rm = (float(nm.mean(indata**2)))
    '''згладжування звуку. Просто:
        90% старого значення рівня гучності - mic_level
        10% нового рівня гучності - rms
        додати значення - отримаємо новий рівень гучності '''
    '''запам'ятовуємо новий рівень гучності в глобальну змінну'''
    mic_level = 0.9 * mic_level + 0.1 * rm
# ---------------- НАЛАШТУВАННЯ ГРИ ----------------

# розмір ігрового вікна:
# WIDTH = ширина (600 пікселів)
# HEIGHT = висота (400 пікселів)
WIDTH = 600
HEIGHT = 400

# розмір пташки:
# ширина 50 px, висота 50 px
SIZE = 50


# розмір труби:
# ширина 50 px, висота 300 px
WIDTH_PIPE = 50
HEIGHT_PIPE = 300

# швидкість руху труб:
# 2 пікселя за кадр (чим більше число — тим швидше)
SPEED = 2


# ---------------- ФУНКЦІЇ ----------------

# функція старту гри (натиснули кнопку → почалась гра)
def start_game():

    # беремо глобальну змінну
    # змінюємо стан гри на "game"
    global game_part
    game_part = "game"

def restart():
    global game_part, score
    game_part = "game"
    score = 0
    bird.rect.y = 100
    pipes = Pipes(w=50,h=300,speed=2,
              img_1="pipe_down.png",img_2="pipe_up.png")

# ---------------- СТВОРЕННЯ ВІКНА ----------------

# створюємо вікно гри з розміром 600x400
window = pygame.display.set_mode((WIDTH,HEIGHT))
# встановлюємо назву вікна
pygame.display.set_caption("Flappy bird")


# ---------------- ЗАВАНТАЖЕННЯ КАРТИНОК ----------------

# фон стартового екрану fon_start.png
fon_start = pygame.image.load("fon_start.png") 
# фон гри fon_game.png
fon_game = pygame.image.load("fon_game.png")


# ---------------- ЧАС ----------------
# створюємо таймер (щоб гра працювала з FPS)
clock = pygame.time.Clock()

# ---------------- ОБ'ЄКТИ ----------------

# створюємо кнопку "Start" викоритовуємо клас Button
# x=200, y=150 (позиція)
# ширина=200, висота=100
# колір кнопки зелений "#00FF00"
# текст "Start"
# колір тексту білий "#FFFFFF"
# функція при натисканні → start_game
btn_start = Button(x=200,y=150,w=200,h=150,color="#00FF00",
                   text="Start",color_text="#FFFFFF",command=start_game)


# створюємо пташку:- використовує клас(треба його написати )Bird
# x=100, y=200 (позиція)
# ширина=50, висота=50
# швидкість падіння = 5
# список картинок (анімація) ["bird1.png", "bird2.png"]
# None — звук або додатковий параметр (не використовується)
bird = Bird(x=100,y=200,s=50
            ,speed=5,frames=["bird1.png", "bird2.png"]) 


# створюємо труби:використовує клас(треба його написати ) Pipes(
# ширина=50, висота=300
# швидкість руху=2
# картинки труб (верхня і нижня)
pipes = Pipes(w=50,h=300,speed=2,
              img_1="pipe_down.png",img_2="pipe_up.png")
score = 0
score_txt = Button(x=10,y=10,w=100,h=50,color=(52,67,228),text=f"{score}",color_text=(14,88,42),command=None)
btn_restart = Button(x=200,y=150,w=200,h=150,color=(250,0,0),color_text=(0,0,0),text="Restart",command=restart)
# ---------------- ЗМІННІ ГРИ ----------------

# змінна для роботи циклу гри (True = гра працює)
run = True
# стан гри:
# "start" — стартовий екран
# "game" — сама гра
game_part = "start"


# ---------------- ГОЛОВНИЙ ЦИКЛ ----------------
'''Посунь весь ігровий цикл на другий рівень - тобто tab  1раз
Щоб додати спеціальний 'менеджера контексту', який стежить за мікрофоном 👉 “включити мікрофон і почати слухати звук”
Аргементи:
1. samplerate - скільки разів в секунду ми “слухаємо” звук - fs
2. channels=1 👉 кількість каналів 1 → моно (один мікрофон)  2 → стерео (два канали)
3. blocksize=block 👉 розмір шматка звуку
4. callback=audio_cb 👉 функція, яка обробляє звук 👉 кожен раз, коли приходить звук → викликається'''
with sd.InputStream(samplerate=fs, channels=1, blocksize=blocks, callback=audio):
    while run:
        # перевіряємо всі події (натискання, закриття)
        for event in pygame.event.get():
            # якщо натиснули на хрестик — виходимо з гри
            if event.type == pygame.QUIT:
                run = False


        # ---------------- ЕКРАН СТАРТУ ----------------
        if game_part == "start":

            # малюємо фон старту (позиція 0,0)
            window.blit(fon_start,(0,0))

            # малюємо кнопку
            btn_start.draw(window)
            # перевіряємо натискання кнопки
            btn_start.is_clicked()


        # ---------------- ОСНОВНА ГРА ----------------
        elif game_part == "game":

            # малюємо фон гри
            window.blit(fon_game,(0,0))
            # оновлюємо пташку (рух, гравітація, малювання)
            bird.update(window)
            score_txt.draw(window)
            '''Додай рух пташки вгору за голосом'''
            '''Якщо гучність вища за вказаний поріг 
            змінити імпульс стрибка = робимо пропорційно силі голосу * 25'''
            if mic_level > TRESH:
                IMPULSE = mic_level * 250
            '''додати до координати у пташки імпульс стрибка(без умов)'''
            bird.rect.y -= IMPULSE
            '''додати стухання імпульсу стрибка *0.8-0.9 '''
            IMPULSE *= 0.8
            # оновлюємо труби (рух, генерація, малювання)
            pipes.update(window)
            for i in range(10):
                if bird.rect.colliderect(pipes.pipes_up[i].rect) or bird.rect.colliderect(pipes.pipes_down[i].rect):
                    score += 1
                    score_txt.add_text(f"{score}")
                    for i in range(10):
                        pipes.pipes_up[i].rect.x += 200
                        pipes.pipes_down[i].rect.x += 200
                    break
            if score >= 10:
                game_part = "restart"
        elif game_part == "restart":
            window.blit(fon_start,(0,0))
            btn_restart.draw(window)
            btn_restart.is_clicked()

        # встановлюємо FPS (60 кадрів в секунду)
        clock.tick(60)
        # оновлюємо екран (показує всі зміни)
        pygame.display.flip()